# =================================== #
# @Author: Fantasy_Silence            #
# @Time: 2024-06-04                   #
# @IDE: Visual Studio Code & PyCharm  #
# @Python: 3.9.7                      #
# =================================== #
# @Description: 一些常量表             #
# =================================== #

# ------ 国家经济分区 ------ #
ECONOMIC_REGION_TABLE_NAME = {
    "东北地区": ["辽宁", "吉林", "黑龙江"],
    "中部地区": ["山西", "安徽", "江西", "河南", "湖北", "湖南"],
    "东部地区": [
        "北京", "天津", "河北", "上海", "江苏", "浙江", 
        "福建", "山东", "广东", "海南"
    ],
    "西部地区": [
        "内蒙古", "广西", "重庆", "四川",
        "贵州", "云南", "西藏", "陕西", "甘肃", "青海",
        "宁夏", "新疆"
    ],
}

# ------ 省会城市(不含直辖) ------ #
PROVINCE_CAPITAL_TABLE_NAME = {
    "安徽": "合肥", "江苏": "南京", "浙江": "杭州", 
    "江西": "南昌", "福建": "福州", "广东": "广州", 
    "湖南": "长沙", "湖北": "武汉", "山东": "济南", 
    "河南": "郑州", "河北": "石家庄", "山西": "太原", 
    "辽宁": "沈阳", "吉林": "长春", "黑龙江": "哈尔滨", 
    "贵州": "贵阳", "云南": "昆明", "陕西": "西安",
    "甘肃": "兰州", "青海": "西宁", "广西": "南宁",
    "西藏": "拉萨", "宁夏": "银川", "新疆": "乌鲁木齐",
    "内蒙古": "呼和浩特", "四川": "成都", "海南": "海口"
}

# ------ 省会城市行政区域面积 ------ #
PROVINCE_CAPITAL_AREA = {
    "合肥": 11445, "南京": 6587, "杭州": 16850, 
    "南昌": 7195, "福州": 11968, "广州": 7434, 
    "长沙": 11819, "武汉": 8569, "济南": 10244, 
    "郑州": 7567, "石家庄": 14464, "太原": 6988, 
    "沈阳": 12860, "长春": 24744, "哈尔滨": 53100, 
    "贵阳": 8034, "昆明": 21013, "西安": 10108,
    "兰州": 13100, "西宁": 7660, "南宁": 22100,
    "拉萨": 31662, "银川": 9025, "乌鲁木齐": 12800,
    "呼和浩特": 17200, "成都": 14335, "海口": 3127,
}

# ------ 各省，自治区，直辖市行政区域面积 ------ #
PROVINCE_AREA = {
    "安徽": 140100, "江苏": 107200, "浙江": 105500, 
    "江西": 166900, "福建": 124000, "广东": 179725, 
    "湖南": 211800, "湖北": 185900, "山东": 155800, 
    "河南": 167000, "河北": 188800, "山西": 156700, 
    "辽宁": 148000, "吉林": 187400, "黑龙江": 473000, 
    "贵州": 176167, "云南": 394100, "陕西": 205600,
    "甘肃": 425800, "青海": 722300, "广西": 237600,
    "西藏": 1228400, "宁夏": 66400, "新疆": 1664900,
    "内蒙古": 1183000, "四川": 486000, "海南": 35400,
    "北京": 16418, "天津": 11934, "上海": 6340, "重庆": 82370
}

# ------ 直辖市 ------ #
DIRECT_CITY = ["北京", "天津", "上海", "重庆"]

# ------ 查询命令 ------ #
SQL_COMMAND = {
    # ------ 第一问 ------ #
    "1.1": [
        "exec investmentscale ", [
            "时间", "固定资产投资总额", "国有经济投资占比", 
            "集体经济投资占比", "私营经济投资占比", "股份制经济投资占比"
        ]
    ],
    "1.2": ["exec investmentdifference ", ["地区", "时间", "固定资产"]],
    "1.4": ["exec SRGinPandemic ", ["省份", "受影响省份个数", "总数", "占比"]],

    # ------ 第二问 ------ #
    "2.1": [
        "drop table GDPcorr_table; exec GDP_corr; select City, Province, GDP_corr from GDPcorr_table order by GDP_corr;",
        ["城市", "省份", "GDP_corr"]
    ],
    "2.2": [
        "exec ComparisonGDP_per ", ["结果"]
    ],
    "2.3": [
        """
        declare @cap int, @dud int, @mun int, @all int;
        select @cap = count(distinct City)/4 from comparison_GDP;
        select @dud = count(*) from GDP_DDD_city;
        select @mun = count(distinct City) from MunicipalityInfo;
        select (@dud/(@mun+@cap));
        select @all = count(distinct City) from comparison_GDP;
        select @dud = count(*) from GDP_DUD;
        select (@dud/@all)
        """, ["结果"]
    ],
    "2.4": [
        "exec TopGDP ", [
            "城市", "省份", "城市GDP增长率", "全省GDP增长率"
        ]
    ],

    # ------ 第三问 ------ #
    "3.1": [
        "exec industrial_structure ", [
            "时间", "第一产业占比", "第二产业占比", "第三产业占比"
        ]
    ],
    "3.2": [
        "exec industrial_structure_compare ", [
            "地区", "时间", "第一产业占比", "第二产业占比", "第三产业占比"
        ]
    ],
    "3.3": [
        "exec industry_mode ", [
            "时间点", "疫情前", "疫情后", "疫情前个数", 
            "疫情后个数", "疫情前占比", "疫情后占比" 
        ]
    ],
    "3.4": ["exec FindSimilarProvince ", ["省份", "相似度"]],

    # ------ 第四问 ------ #
    "4.1": [
        "exec income ", [
            "省份", "时间", "第一产业占比", "第二产业占比", "第三产业占比"
        ]
    ],
    "4.2": [
        "exec income_compare ", [
            "省份", "行政面积", "GDP", "人均GDP", "居民收入", "人口密度"
        ]
    ],
    "4.3": [
        "exec FindConsistentIncomeLevels ", ["结果"]
    ],
    "4.4": [
        "select * from comparison_income", ["地区", "时间", "收入增长率"]
    ],
    "4.5": [
        """
        select s1.Region, s1.Tyear
        from comparison_income s1, comparison_income s2
        where s1.Region = s2.Region and
            convert(int, s2.Tyear)=convert(int, s1.Tyear)-1 and
            s1.Income_growthrate < s2.Income_growthrate and
            convert(int, s1.Tyear) between 2020 and 2022;
        """, ["地区", "年份"]
    ],
}
